### PROJECT DESCRIPTION

This store sales forecasting project offers a valuable resource for businesses operating in the retail furniture sector. 
By analyzing historical sales data from the superstore dataset, users can gain insights into future sales patterns and trends. 
This information can be utilized to optimize inventory management strategies, anticipate customer demand, and enhance overall operational efficiency.

In [1]:
import pandas as pd

In [2]:
holiday_df = pd.read_csv('datasets/holidays_events.csv')
print(holiday_df.shape)
print(holiday_df.info())
holiday_df.head()

(350, 6)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         350 non-null    object
 1   type         350 non-null    object
 2   locale       350 non-null    object
 3   locale_name  350 non-null    object
 4   description  350 non-null    object
 5   transferred  350 non-null    bool
dtypes: bool(1), object(5)
memory usage: 14.1+ KB
None

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [3]:
oil_df = pd.read_csv('datasets/oil.csv') 
print(oil_df.shape)
print(oil_df.info()) 
oil_df.head()

(1218, 2)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB
None

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [4]:
store_df = pd.read_csv('datasets/stores.csv') 
print(store_df.shape)
print(store_df.info())
store_df.head()

(54, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_nbr  54 non-null     int64
 1   city       54 non-null     object
 2   state      54 non-null     object
 3   type       54 non-null     object
 4   cluster    54 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.2+ KB
None

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [5]:
test_df = pd.read_csv('datasets/test.csv') 
print(test_df.shape)
print(test_df.info())
test_df.head()

(28512, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           28512 non-null  int64
 1   date         28512 non-null  object
 2   store_nbr    28512 non-null  int64
 3   family       28512 non-null  object
 4   onpromotion  28512 non-null  int64
dtypes: int64(3), object(2)
memory usage: 1.1+ MB
None

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [6]:
train_df = pd.read_csv('datasets/train.csv') 
print(train_df.shape)
print(train_df.info)
train_df.head()

(3000888, 6)
<bound method DataFrame.info of               id        date  store_nbr                      family     sales  \
0              0  2013-01-01          1                  AUTOMOTIVE     0.000
1              1  2013-01-01          1                   BABY CARE     0.000
2              2  2013-01-01          1                      BEAUTY     0.000
3              3  2013-01-01          1                   BEVERAGES     0.000
4              4  2013-01-01          1                       BOOKS     0.000
...          ...         ...        ...                         ...       ...
3000883  3000883  2017-08-15          9                     POULTRY   438.133
3000884  3000884  2017-08-15          9              PREPARED FOODS   154.553
3000885  3000885  2017-08-15          9                     PRODUCE  2419.729
3000886  3000886  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
3000887  3000887  2017-08-15          9                     SEAFOOD    16.000

         onpromotion
0                  0
1                  0
2                  0
3                  0
4                  0
...              ...
3000883            0
3000884            1
3000885          148
3000886            8
3000887            0

[3000888 rows x 6 columns]>

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [7]:
transaction_df = pd.read_csv('datasets/transactions.csv')
print(transaction_df.shape)
print(transaction_df.info()) 
transaction_df.head()

(83488, 3)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB
None

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

#### checking for null values in the datasets

In [8]:
holiday_df.isna().sum()

date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64

In [9]:
oil_df.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [10]:
store_df.isna().sum()

store_nbr    0
city         0
state        0
type         0
cluster      0
dtype: int64

In [11]:
train_df.isna().sum()

id             0
date           0
store_nbr      0
family         0
sales          0
onpromotion    0
dtype: int64

In [12]:
transaction_df.isna().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

### Exploratory Data Analysis

Converting time to timestamps

In [13]:
def timestamps(df):
    df['date'] = pd.to_datetime(df['date'])
    df['weekday'] = df['date'].dt.weekday
    df['month'] = df['date'].dt.month 
    df['year'] = df['date'].dt.year
    df['quarter'] = df['date'].dt.quarter
    
    
    df = df.drop(columns=['date']) 
    return df

In [14]:
holiday_df = timestamps(holiday_df)
holiday_df.head()

,type,locale,locale_name,description,transferred,weekday,month,year,quarter
0,Holiday,Local,Manta,Fundacion de Manta,False,4,3,2012,1
1,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False,6,4,2012,2
2,Holiday,Local,Cuenca,Fundacion de Cuenca,False,3,4,2012,2
3,Holiday,Local,Libertad,Cantonizacion de Libertad,False,5,4,2012,2
4,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False,5,4,2012,2

In [15]:
oil_df = timestamps(oil_df)
oil_df.head()

   dcoilwtico  weekday  month  year  quarter
0         NaN        1      1  2013        1
1       93.14        2      1  2013        1
2       92.97        3      1  2013        1
3       93.12        4      1  2013        1
4       93.20        0      1  2013        1

In [16]:
test_df = timestamps(test_df)
test_df.head()

        id  store_nbr      family  onpromotion  weekday  month  year  quarter
0  3000888          1  AUTOMOTIVE            0        2      8  2017        3
1  3000889          1   BABY CARE            0        2      8  2017        3
2  3000890          1      BEAUTY            2        2      8  2017        3
3  3000891          1   BEVERAGES           20        2      8  2017        3
4  3000892          1       BOOKS            0        2      8  2017        3

In [17]:
train_df = timestamps(train_df)
train_df.head()

,id,store_nbr,family,sales,onpromotion,weekday,month,year,quarter
0,0,1,AUTOMOTIVE,0.0,0,1,1,2013,1
1,1,1,BABY CARE,0.0,0,1,1,2013,1
2,2,1,BEAUTY,0.0,0,1,1,2013,1
3,3,1,BEVERAGES,0.0,0,1,1,2013,1
4,4,1,BOOKS,0.0,0,1,1,2013,1

In [18]:
transaction_df = timestamps(transaction_df)
transaction_df.head()

   store_nbr  transactions  weekday  month  year  quarter
0         25           770        1      1  2013        1
1          1          2111        2      1  2013        1
2          2          2358        2      1  2013        1
3          3          3487        2      1  2013        1
4          4          1922        2      1  2013        1

In [19]:
# Ensure each DataFrame's 'Timestamp' column is in datetime format
dataframes = [
    holiday_df,
    oil_df,
    transaction_df,
    train_df
]



# Now concatenate all DataFrames along the rows
merged_data = pd.concat(dataframes, ignore_index=True)

# Sort by 'Timestamp' and reset the index
merged_data = merged_data.sort_values(by='year').reset_index(drop=True)

# Display the merged DataFrame
print(merged_data)

            type    locale                     locale_name  \
0        Holiday     Local                           Manta
1        Holiday  Regional  Santo Domingo de los Tsachilas
2        Holiday  Regional                     Santa Elena
3        Holiday     Local                        Guaranda
4        Holiday     Local                       Latacunga
...          ...       ...                             ...
3085939      NaN       NaN                             NaN
3085940      NaN       NaN                             NaN
3085941      NaN       NaN                             NaN
3085942      NaN       NaN                             NaN
3085943      NaN       NaN                             NaN

                                description transferred  weekday  month  year  \
0                        Fundacion de Manta       False        4      3  2012
1        Provincializacion de Santo Domingo       False        1     11  2012
2             Provincializacion Santa Elena       False        2     11  2012
3                 Independencia de Guaranda       False        5     11  2012
4                Independencia de Latacunga       False        6     11  2012
...                                     ...         ...      ...    ...   ...
3085939                                 NaN         NaN        0      3  2017
3085940                                 NaN         NaN        0      3  2017
3085941                                 NaN         NaN        0      3  2017
3085942                                 NaN         NaN        0      3  2017
3085943                                 NaN         NaN        1      8  2017

         quarter  dcoilwtico  store_nbr  transactions         id  \
0              1         NaN        NaN           NaN        NaN
1              4         NaN        NaN           NaN        NaN
2              4         NaN        NaN           NaN        NaN
3              4         NaN        NaN           NaN        NaN
4              4         NaN        NaN           NaN        NaN
...          ...         ...        ...           ...        ...
3085939        1         NaN       11.0           NaN  2722989.0
3085940        1         NaN       11.0           NaN  2722988.0
3085941        1         NaN       11.0           NaN  2722987.0
3085942        1         NaN       12.0           NaN  2722997.0
3085943        3         NaN        9.0           NaN  3000887.0

                          family  sales  onpromotion
0                            NaN    NaN          NaN
1                            NaN    NaN          NaN
2                            NaN    NaN          NaN
3                            NaN    NaN          NaN
4                            NaN    NaN          NaN
...                          ...    ...          ...
3085939  PLAYERS AND ELECTRONICS   12.0          0.0
3085940             PET SUPPLIES    3.0          0.0
3085941            PERSONAL CARE  364.0         16.0
3085942                   BEAUTY    2.0          1.0
3085943                  SEAFOOD   16.0          0.0

[3085944 rows x 16 columns]

In [20]:
merged_data.head()

,type,locale,locale_name,description,transferred,weekday,month,year,quarter,dcoilwtico,store_nbr,transactions,id,family,sales,onpromotion
0,Holiday,Local,Manta,Fundacion de Manta,False,4,3,2012,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Holiday,Regional,Santo Domingo de los Tsachilas,Provincializacion de Santo Domingo,False,1,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Holiday,Regional,Santa Elena,Provincializacion Santa Elena,False,2,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Holiday,Local,Guaranda,Independencia de Guaranda,False,5,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Holiday,Local,Latacunga,Independencia de Latacunga,False,6,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
merged_data = pd.merge(merged_data, store_df, on='store_nbr', how='left')
merged_data.head()

,type_x,locale,locale_name,description,transferred,weekday,month,year,quarter,dcoilwtico,store_nbr,transactions,id,family,sales,onpromotion,city,state,type_y,cluster
0,Holiday,Local,Manta,Fundacion de Manta,False,4,3,2012,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Holiday,Regional,Santo Domingo de los Tsachilas,Provincializacion de Santo Domingo,False,1,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Holiday,Regional,Santa Elena,Provincializacion Santa Elena,False,2,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Holiday,Local,Guaranda,Independencia de Guaranda,False,5,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Holiday,Local,Latacunga,Independencia de Latacunga,False,6,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [22]:
merged_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3085944 entries, 0 to 3085943
Data columns (total 20 columns):
 #   Column        Dtype
---  ------        -----
 0   type_x        object
 1   locale        object
 2   locale_name   object
 3   description   object
 4   transferred   object
 5   weekday       int32
 6   month         int32
 7   year          int32
 8   quarter       int32
 9   dcoilwtico    float64
 10  store_nbr     float64
 11  transactions  float64
 12  id            float64
 13  family        object
 14  sales         float64
 15  onpromotion   float64
 16  city          object
 17  state         object
 18  type_y        object
 19  cluster       float64
dtypes: float64(7), int32(4), object(9)
memory usage: 423.8+ MB

In [23]:
merged_data.isna().sum()

type_x          3085594
locale          3085594
locale_name     3085594
description     3085594
transferred     3085594
weekday               0
month                 0
year                  0
quarter               0
dcoilwtico      3084769
store_nbr          1568
transactions    3002456
id                85056
family            85056
sales             85056
onpromotion       85056
city               1568
state              1568
type_y             1568
cluster            1568
dtype: int64

Dropping unwanted columns having over 3million nun values this could peotentially mess with the analysis

In [24]:
merged_data.drop(columns=['type_x','locale','locale_name','description','transferred'])

,weekday,month,year,quarter,dcoilwtico,store_nbr,transactions,id,family,sales,onpromotion,city,state,type_y,cluster
0,4,3,2012,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,5,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,6,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3085939,0,3,2017,1,NaN,11.0,NaN,2722989.0,PLAYERS AND ELECTRONICS,12.0,0.0,Cayambe,Pichincha,B,6.0
3085940,0,3,2017,1,NaN,11.0,NaN,2722988.0,PET SUPPLIES,3.0,0.0,Cayambe,Pichincha,B,6.0
3085941,0,3,2017,1,NaN,11.0,NaN,2722987.0,PERSONAL CARE,364.0,16.0,Cayambe,Pichincha,B,6.0
3085942,0,3,2017,1,NaN,12.0,NaN,2722997.0,BEAUTY,2.0,1.0,Latacunga,Cotopaxi,C,15.0
3085943,1,8,2017,3,NaN,9.0,NaN,3000887.0,SEAFOOD,16.0,0.0,Quito,Pichincha,B,6.0

In [25]:
merged_data['dcoilwtico'].ffill(inplace= True)

In [26]:
merged_data['sales'].fillna(0, inplace=True)

In [27]:
merged_data['onpromotion'].fillna(0, inplace=True)

In [28]:
merged_data.isna().sum()

type_x          3085594
locale          3085594
locale_name     3085594
description     3085594
transferred     3085594
weekday               0
month                 0
year                  0
quarter               0
dcoilwtico       466236
store_nbr          1568
transactions    3002456
id                85056
family            85056
sales                 0
onpromotion           0
city               1568
state              1568
type_y             1568
cluster            1568
dtype: int64

In [29]:
merged_data['transactions'].fillna(merged_data['transactions'].median(), inplace=True)

In [30]:
merged_data.dropna(subset=['store_nbr', 'family'], inplace=True)

In [31]:
merged_data.isna().sum()

type_x          3000888
locale          3000888
locale_name     3000888
description     3000888
transferred     3000888
weekday               0
month                 0
year                  0
quarter               0
dcoilwtico       460282
store_nbr             0
transactions          0
id                    0
family                0
sales                 0
onpromotion           0
city                  0
state                 0
type_y                0
cluster               0
dtype: int64

type_x, locale, locale_name, description, transferred

These columns have a high number of missing values, mostly in rows without holiday information.
Since not every date is a holiday, it makes sense to fill these missing values with a placeholder like "None" or "No Holiday.""

In [32]:
# Fill missing holiday-related columns with 'None' or similar placeholder
merged_data['type_x'].fillna('No Holiday', inplace=True)
merged_data['locale'].fillna('No Locale', inplace=True)
merged_data['locale_name'].fillna('No Locale Name', inplace=True)
merged_data['description'].fillna('No Description', inplace=True)
merged_data['transferred'].fillna(False, inplace=True)

# Fill missing oil prices using forward fill method, backfill if necessary
merged_data['dcoilwtico'].fillna(method='ffill', inplace=True)
merged_data['dcoilwtico'].fillna(method='bfill', inplace=True)

# Set missing transactions to 0
merged_data['transactions'].fillna(0, inplace=True)

# Set missing sales and onpromotion values to 0
merged_data['sales'].fillna(0, inplace=True)
merged_data['onpromotion'].fillna(0, inplace=True)

# Fill missing store-related data (city, state, type, cluster) with placeholders or drop if necessary
merged_data['city'].fillna('Unknown City', inplace=True)
merged_data['state'].fillna('Unknown State', inplace=True)
merged_data['type_y'].fillna('Unknown Type', inplace=True)
merged_data['cluster'].fillna(-1, inplace=True)

# Drop rows with missing 'id' as they may not represent transactions
merged_data.dropna(subset=['id'], inplace=True)

C:\Users\pc\AppData\Local\Temp\ipykernel_12208\3919061564.py:9: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  merged_data['dcoilwtico'].fillna(method='ffill', inplace=True)
C:\Users\pc\AppData\Local\Temp\ipykernel_12208\3919061564.py:10: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  merged_data['dcoilwtico'].fillna(method='bfill', inplace=True)

In [33]:
merged_data.isna().sum()

type_x          0
locale          0
locale_name     0
description     0
transferred     0
weekday         0
month           0
year            0
quarter         0
dcoilwtico      0
store_nbr       0
transactions    0
id              0
family          0
sales           0
onpromotion     0
city            0
state           0
type_y          0
cluster         0
dtype: int64

In [34]:
merged_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3000888 entries, 41 to 3085943
Data columns (total 20 columns):
 #   Column        Dtype
---  ------        -----
 0   type_x        object
 1   locale        object
 2   locale_name   object
 3   description   object
 4   transferred   bool
 5   weekday       int32
 6   month         int32
 7   year          int32
 8   quarter       int32
 9   dcoilwtico    float64
 10  store_nbr     float64
 11  transactions  float64
 12  id            float64
 13  family        object
 14  sales         float64
 15  onpromotion   float64
 16  city          object
 17  state         object
 18  type_y        object
 19  cluster       float64
dtypes: bool(1), float64(7), int32(4), object(8)
memory usage: 415.0+ MB

In [35]:
merged_data.isna().sum()

type_x          0
locale          0
locale_name     0
description     0
transferred     0
weekday         0
month           0
year            0
quarter         0
dcoilwtico      0
store_nbr       0
transactions    0
id              0
family          0
sales           0
onpromotion     0
city            0
state           0
type_y          0
cluster         0
dtype: int64

#### CATEGORICAL COLUMNS

In [36]:
categorical_columns = merged_data.select_dtypes(include=['object']).columns

In [37]:
# Select the columns you want to one-hot encode
categorical_columns = ['type_x', 'locale', 'locale_name', 'description', 'transferred', 'city', 'state', 'type_y']

# Apply one-hot encoding
df_encoded = pd.get_dummies(merged_data, columns=categorical_columns, drop_first=True)

In [38]:
df_encoded.info()
df_encoded.head()

<class 'pandas.core.frame.DataFrame'>
Index: 3000888 entries, 41 to 3085943
Data columns (total 52 columns):
 #   Column                                Dtype
---  ------                                -----
 0   weekday                               int32
 1   month                                 int32
 2   year                                  int32
 3   quarter                               int32
 4   dcoilwtico                            float64
 5   store_nbr                             float64
 6   transactions                          float64
 7   id                                    float64
 8   family                                object
 9   sales                                 float64
 10  onpromotion                           float64
 11  cluster                               float64
 12  city_Babahoyo                         bool
 13  city_Cayambe                          bool
 14  city_Cuenca                           bool
 15  city_Daule                            bool
 16  city_El Carmen                        bool
 17  city_Esmeraldas                       bool
 18  city_Guaranda                         bool
 19  city_Guayaquil                        bool
 20  city_Ibarra                           bool
 21  city_Latacunga                        bool
 22  city_Libertad                         bool
 23  city_Loja                             bool
 24  city_Machala                          bool
 25  city_Manta                            bool
 26  city_Playas                           bool
 27  city_Puyo                             bool
 28  city_Quevedo                          bool
 29  city_Quito                            bool
 30  city_Riobamba                         bool
 31  city_Salinas                          bool
 32  city_Santo Domingo                    bool
 33  state_Bolivar                         bool
 34  state_Chimborazo                      bool
 35  state_Cotopaxi                        bool
 36  state_El Oro                          bool
 37  state_Esmeraldas                      bool
 38  state_Guayas                          bool
 39  state_Imbabura                        bool
 40  state_Loja                            bool
 41  state_Los Rios                        bool
 42  state_Manabi                          bool
 43  state_Pastaza                         bool
 44  state_Pichincha                       bool
 45  state_Santa Elena                     bool
 46  state_Santo Domingo de los Tsachilas  bool
 47  state_Tungurahua                      bool
 48  type_y_B                              bool
 49  type_y_C                              bool
 50  type_y_D                              bool
 51  type_y_E                              bool
dtypes: bool(40), float64(7), int32(4), object(1)
memory usage: 366.3+ MB

,weekday,month,year,quarter,dcoilwtico,store_nbr,transactions,id,family,sales,...,state_Manabi,state_Pastaza,state_Pichincha,state_Santa Elena,state_Santo Domingo de los Tsachilas,state_Tungurahua,type_y_B,type_y_C,type_y_D,type_y_E
41,3,8,2013,3,104.9,47.0,1393.0,404093.0,DAIRY,723.0,...,False,False,True,False,False,False,False,False,False,False
42,3,8,2013,3,104.9,47.0,1393.0,404092.0,CLEANING,1441.0,...,False,False,True,False,False,False,False,False,False,False
43,3,8,2013,3,104.9,47.0,1393.0,404091.0,CELEBRATION,0.0,...,False,False,True,False,False,False,False,False,False,False
44,3,8,2013,3,104.9,47.0,1393.0,404087.0,BEAUTY,9.0,...,False,False,True,False,False,False,False,False,False,False
45,3,8,2013,3,104.9,47.0,1393.0,404089.0,BOOKS,0.0,...,False,False,True,False,False,False,False,False,False,False

In [39]:
merged_data['sales'].info()

<class 'pandas.core.series.Series'>
Index: 3000888 entries, 41 to 3085943
Series name: sales
Non-Null Count    Dtype
--------------    -----
3000888 non-null  float64
dtypes: float64(1)
memory usage: 45.8 MB

In [40]:
merged_data['transactions'].info()

<class 'pandas.core.series.Series'>
Index: 3000888 entries, 41 to 3085943
Series name: transactions
Non-Null Count    Dtype
--------------    -----
3000888 non-null  float64
dtypes: float64(1)
memory usage: 45.8 MB

In [41]:

merged_data['dcoilwtico'].info()

<class 'pandas.core.series.Series'>
Index: 3000888 entries, 41 to 3085943
Series name: dcoilwtico
Non-Null Count    Dtype
--------------    -----
3000888 non-null  float64
dtypes: float64(1)
memory usage: 45.8 MB

In [42]:
df_encoded.columns

Index(['weekday', 'month', 'year', 'quarter', 'dcoilwtico', 'store_nbr',
       'transactions', 'id', 'family', 'sales', 'onpromotion', 'cluster',
       'city_Babahoyo', 'city_Cayambe', 'city_Cuenca', 'city_Daule',
       'city_El Carmen', 'city_Esmeraldas', 'city_Guaranda', 'city_Guayaquil',
       'city_Ibarra', 'city_Latacunga', 'city_Libertad', 'city_Loja',
       'city_Machala', 'city_Manta', 'city_Playas', 'city_Puyo',
       'city_Quevedo', 'city_Quito', 'city_Riobamba', 'city_Salinas',
       'city_Santo Domingo', 'state_Bolivar', 'state_Chimborazo',
       'state_Cotopaxi', 'state_El Oro', 'state_Esmeraldas', 'state_Guayas',
       'state_Imbabura', 'state_Loja', 'state_Los Rios', 'state_Manabi',
       'state_Pastaza', 'state_Pichincha', 'state_Santa Elena',
       'state_Santo Domingo de los Tsachilas', 'state_Tungurahua', 'type_y_B',
       'type_y_C', 'type_y_D', 'type_y_E'],
      dtype='object')

### FEATURE ENGINEERING

In [43]:
# Assuming 'year' should be derived from the 'date' column in each DataFrame
for df in dataframes:
    if 'date' in df.columns:
        df['year'] = pd.to_datetime(df['date']).dt.year  # Extract year from date if 'date' column exists
    elif 'year' not in df.columns:
        df['year'] = np.nan  # Fill missing 'year' if 'date' and 'year' are missing

# Now concatenate all DataFrames along the rows
merged_data = pd.concat(dataframes, ignore_index=True)

# Check if 'year' exists after merging
print("Columns in merged_data:", merged_data.columns)

# If 'year' exists, proceed with sorting
if 'year' in merged_data.columns:
    merged_data = merged_data.sort_values(by='year').reset_index(drop=True)
else:
    print("'year' column is missing in merged_data after merging.")

# Display the merged DataFrame
print(merged_data.head())

Columns in merged_data: Index(['type', 'locale', 'locale_name', 'description', 'transferred',
       'weekday', 'month', 'year', 'quarter', 'dcoilwtico', 'store_nbr',
       'transactions', 'id', 'family', 'sales', 'onpromotion'],
      dtype='object')
      type    locale                     locale_name  \
0  Holiday     Local                           Manta
1  Holiday  Regional  Santo Domingo de los Tsachilas
2  Holiday  Regional                     Santa Elena
3  Holiday     Local                        Guaranda
4  Holiday     Local                       Latacunga

                          description transferred  weekday  month  year  \
0                  Fundacion de Manta       False        4      3  2012
1  Provincializacion de Santo Domingo       False        1     11  2012
2       Provincializacion Santa Elena       False        2     11  2012
3           Independencia de Guaranda       False        5     11  2012
4          Independencia de Latacunga       False        6     11  2012

   quarter  dcoilwtico  store_nbr  transactions  id family  sales  onpromotion
0        1         NaN        NaN           NaN NaN    NaN    NaN          NaN
1        4         NaN        NaN           NaN NaN    NaN    NaN          NaN
2        4         NaN        NaN           NaN NaN    NaN    NaN          NaN
3        4         NaN        NaN           NaN NaN    NaN    NaN          NaN
4        4         NaN        NaN           NaN NaN    NaN    NaN          NaN

### Rolling features

Getting the 7-day rolling average of sales

In [44]:
merged_data['sales_7d_avg'] = merged_data['sales'].rolling(window=7).mean()

Using Lag features

In [45]:
merged_data['sales_lag_1'] = merged_data['sales'].shift(1)

This shifts the sales column down by one row, so each row in sales_lag_1 now contains the value of sales from the previous day.

In [46]:
# Create binary column 'is_promotion' where 1 indicates promotion, 0 indicates no promotion
merged_data['is_promotion'] = merged_data['onpromotion'].apply(lambda x: 1 if x > 0 else 0)

In [47]:
merged_data.head()

,type,locale,locale_name,description,transferred,weekday,month,year,quarter,dcoilwtico,store_nbr,transactions,id,family,sales,onpromotion,sales_7d_avg,sales_lag_1,is_promotion
0,Holiday,Local,Manta,Fundacion de Manta,False,4,3,2012,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0
1,Holiday,Regional,Santo Domingo de los Tsachilas,Provincializacion de Santo Domingo,False,1,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0
2,Holiday,Regional,Santa Elena,Provincializacion Santa Elena,False,2,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0
3,Holiday,Local,Guaranda,Independencia de Guaranda,False,5,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0
4,Holiday,Local,Latacunga,Independencia de Latacunga,False,6,11,2012,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0

In [48]:
merged_data['type'].value_counts()

type
Holiday       221
Event          56
Additional     51
Transfer       12
Bridge          5
Work Day        5
Name: count, dtype: int64

In [49]:
# One-hot encode the 'type' column and assign it directly to merged_data
merged_data = merged_data.join(pd.get_dummies(merged_data['type'], prefix='type').astype(int))

# Optionally, drop the original 'type' column if it's no longer needed
merged_data = merged_data.drop(columns=['type'])

# Check the DataFrame to ensure only 'type' column is encoded
merged_data.head()

,locale,locale_name,description,transferred,weekday,month,year,quarter,dcoilwtico,store_nbr,...,onpromotion,sales_7d_avg,sales_lag_1,is_promotion,type_Additional,type_Bridge,type_Event,type_Holiday,type_Transfer,type_Work Day
0,Local,Manta,Fundacion de Manta,False,4,3,2012,1,NaN,NaN,...,NaN,NaN,NaN,0,0,0,0,1,0,0
1,Regional,Santo Domingo de los Tsachilas,Provincializacion de Santo Domingo,False,1,11,2012,4,NaN,NaN,...,NaN,NaN,NaN,0,0,0,0,1,0,0
2,Regional,Santa Elena,Provincializacion Santa Elena,False,2,11,2012,4,NaN,NaN,...,NaN,NaN,NaN,0,0,0,0,1,0,0
3,Local,Guaranda,Independencia de Guaranda,False,5,11,2012,4,NaN,NaN,...,NaN,NaN,NaN,0,0,0,0,1,0,0
4,Local,Latacunga,Independencia de Latacunga,False,6,11,2012,4,NaN,NaN,...,NaN,NaN,NaN,0,0,0,0,1,0,0

In [50]:
merged_data['locale_name'].value_counts()

locale_name
Ecuador                           174
Quito                              13
Riobamba                           12
Guaranda                           12
Latacunga                          12
Ambato                             12
Guayaquil                          11
Cuenca                              7
Ibarra                              7
Santa Elena                         6
Cotopaxi                            6
Santo Domingo                       6
Esmeraldas                          6
Cayambe                             6
El Carmen                           6
Quevedo                             6
Machala                             6
Salinas                             6
Imbabura                            6
Puyo                                6
Santo Domingo de los Tsachilas      6
Libertad                            6
Loja                                6
Manta                               6
Name: count, dtype: int64

In [51]:
merged_data['locale'].value_counts()

locale
National    174
Local       152
Regional     24
Name: count, dtype: int64

In [52]:
merged_data['description'].value_counts()

description
Carnaval                         10
Fundacion de Ibarra               7
Fundacion de Cuenca               7
Fundacion de Manta                6
Provincializacion de Cotopaxi     6
                                 ..
Terremoto Manabi+11               1
Terremoto Manabi+10               1
Terremoto Manabi+9                1
Terremoto Manabi+15               1
Traslado Fundacion de Quito       1
Name: count, Length: 103, dtype: int64

In [ ]:
merged_data['transferred'].value_counts()

transferred
False    338
True      12
Name: count, dtype: int64

In [54]:
# Get the frequency count of each unique value in the 'description' column
frequency_encoding = merged_data['description'].value_counts()

# Map the frequency to each row in the 'description' column
merged_data['description_encoded'] = merged_data['description'].map(frequency_encoding)

# Drop the original 'description' column if it's no longer needed
merged_data = merged_data.drop(columns=['description'])

# Check the DataFrame to verify encoding
merged_data.head()

,locale,locale_name,transferred,weekday,month,year,quarter,dcoilwtico,store_nbr,transactions,...,sales_7d_avg,sales_lag_1,is_promotion,type_Additional,type_Bridge,type_Event,type_Holiday,type_Transfer,type_Work Day,description_encoded
0,Local,Manta,False,4,3,2012,1,NaN,NaN,NaN,...,NaN,NaN,0,0,0,0,1,0,0,6.0
1,Regional,Santo Domingo de los Tsachilas,False,1,11,2012,4,NaN,NaN,NaN,...,NaN,NaN,0,0,0,0,1,0,0,6.0
2,Regional,Santa Elena,False,2,11,2012,4,NaN,NaN,NaN,...,NaN,NaN,0,0,0,0,1,0,0,6.0
3,Local,Guaranda,False,5,11,2012,4,NaN,NaN,NaN,...,NaN,NaN,0,0,0,0,1,0,0,6.0
4,Local,Latacunga,False,6,11,2012,4,NaN,NaN,NaN,...,NaN,NaN,0,0,0,0,1,0,0,6.0